Extension/DataProcessors/ЗагрузкаКорректировокВУПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКорректировокВУПП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extension/InformationRegisters/ТранзакцииESD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТранзакцииESD</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AgreementScId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NomenclatureScId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ServerTxId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TxRef</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Manufacture</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extension/InformationRegisters/КорректировкиESD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КорректировкиESD</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ServerTxId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extension/DataProcessors/ЗагрузкаКорректировокВУПП/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Сервер = "http://172.17.244.7/1csc/ws/esdws.1cws?wsdl";  //рабочая база
	//Сервер = "http://sv08/DEV03/ws/esdws.1cws?wsdl";
	Пользователь = "ESD";
	Пароль = "webs2689";
	
	Определение = Новый WSОпределения(Сервер, Пользователь, Пароль);
	
	WSПрокси = Новый WSПрокси(Определение, "www.softclub.ru", "ESD", "ESDSoap");
	WSПрокси.Пользователь = Пользователь;
	WSПрокси.Пароль = Пароль;	
	
	//WSПрокси = WSСсылки.SC_ESD.СоздатьWSПрокси("www.softclub.ru", "ESD", "ESDSoap");
	//WSПрокси.Пользователь = "ESD";
	//WSПрокси.Пароль = "webs2689";
	
	
	////////// корректировка реализаций
	
	
	Если Продажи Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Продажи.Date КАК Date,
			|	Продажи.AgreementScId КАК AgreementScId,
			|	Продажи.NomenclatureScId КАК NomenclatureScId,
			|	КОЛИЧЕСТВО(Продажи.ServerTxId) КАК QT,
			//|	СУММА(Продажи.Price) КАК РРЦ,
			//|	СУММА(ЕСТЬNULL(Корректировки.Price, Продажи.Price)) КАК ЦенаМВ,
			|	СУММА(ВЫБОР
			|		КОГДА ЕСТЬNULL(Корректировки.Price, Продажи.Price) < Продажи.Price
			|			ТОГДА Продажи.Price
			|			ИНАЧЕ ЕСТЬNULL(Корректировки.Price, Продажи.Price)
			|		КОНЕЦ) КАК Summa
			|ИЗ
			|	РегистрСведений.ТранзакцииESD КАК Продажи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректировкиESD КАК Корректировки
			|		ПО (Продажи.ServerTxId = Корректировки.ServerTxId)
			|ГДЕ
			|	Продажи.TxRef = 0
			|	И Продажи.Date МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И (НЕ Корректировки.Обработано
			|			ИЛИ Корректировки.Price ЕСТЬ NULL)
			|
			|	И (Продажи.AgreementScId = ""с00008488""
			|			ИЛИ Продажи.AgreementScId = ""с00008490"")
			//|	И (Продажи.AgreementScId = ""с00008490"")
			|
			|
			|СГРУППИРОВАТЬ ПО
			|	Продажи.Date,
			|	Продажи.AgreementScId,
			|	Продажи.NomenclatureScId
			|
			|УПОРЯДОЧИТЬ ПО
			|	Date,
			|	AgreementScId,
			|	NomenclatureScId
			|ИТОГИ ПО
			|	Date,
			|	AgreementScId
			|";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить();
		
		TableAdjustments = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "TableAdjustments"));
		ВыборкаДата = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ElementDate = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementDate"));
			ElementDate.Date = ВыборкаДата.Date;
			ВыборкаАккаунт = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАккаунт.Следующий() Цикл
				ElementAgreement = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementAgreement"));
				ElementAgreement.Rtl = ВыборкаАккаунт.AgreementScId;
				ВыборкаНоменклатура = ВыборкаАккаунт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					ElementNomenclature = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementNomenclature"));
					ElementNomenclature.Art = ВыборкаНоменклатура.NomenclatureScId;
					ElementNomenclature.QT = ВыборкаНоменклатура.QT;
					ElementNomenclature.Date = Дата(1,1,1);
					ElementNomenclature.Summa = ВыборкаНоменклатура.Summa;
					ElementAgreement.Nomenclatures.Добавить(ElementNomenclature);
				КонецЦикла;
				ElementDate.Agreements.Добавить(ElementAgreement);
			КонецЦикла;
			TableAdjustments.Dates.Добавить(ElementDate);
		КонецЦикла;
		
		Значение = WSПрокси.LoadSaleAdjustments(TableAdjustments);
		
		Если Значение.Success Тогда
			Сообщить("Корректирока реализаций успешно");
		КонецЕсли;
		
	КонецЕсли;
		
	
	////////// корректировка возвратов
	
	Если Возвраты Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Возвраты.Date КАК Date,
			|	Возвраты.AgreementScId КАК AgreementScId,
			|	Возвраты.NomenclatureScId КАК NomenclatureScId,
			|	Продажи.Date КАК SaleDate,
			|	КОЛИЧЕСТВО(Возвраты.ServerTxId) КАК Qt,
			//|	СУММА(Возвраты.Price) КАК РРЦ,
			//|	СУММА(ЕСТЬNULL(Корректировки.Price, Возвраты.Price)) КАК ЦенаМВ,
			|	СУММА(ВЫБОР
			|		КОГДА ЕСТЬNULL(Корректировки.Price, Возвраты.Price) < Возвраты.Price
			|			ТОГДА Возвраты.Price
			|		ИНАЧЕ ЕСТЬNULL(Корректировки.Price, Возвраты.Price)
			|	КОНЕЦ) КАК Summa
			|ИЗ
			|	РегистрСведений.ТранзакцииESD КАК Возвраты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииESD КАК Продажи
			|		ПО Возвраты.TxRef = Продажи.ServerTxId
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректировкиESD КАК Корректировки
			|		ПО Продажи.ServerTxId = Корректировки.ServerTxId
			|
			|ГДЕ
			|	НЕ Возвраты.TxRef = 0
			|	И Возвраты.Date МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И (Возвраты.AgreementScId = ""с00008488""
			|			ИЛИ Возвраты.AgreementScId = ""с00008490"")
			|
			|СГРУППИРОВАТЬ ПО
			|	Возвраты.Date,
			|	Возвраты.AgreementScId,
			|	Возвраты.NomenclatureScId,
			|	Продажи.Date
			|
			|УПОРЯДОЧИТЬ ПО
			|	Date,
			|	AgreementScId,
			|	NomenclatureScId
			|ИТОГИ ПО
			|	Date,
			|	AgreementScId		
			|";
			
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить();
		
		TableAdjustments = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "TableAdjustments"));
		ВыборкаДата = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ElementDate = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementDate"));
			ElementDate.Date = ВыборкаДата.Date;
			ВыборкаАккаунт = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАккаунт.Следующий() Цикл
				ElementAgreement = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementAgreement"));
				ElementAgreement.Rtl = ВыборкаАккаунт.AgreementScId;
				ВыборкаНоменклатура = ВыборкаАккаунт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					ElementNomenclature = WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип("ESD", "ElementNomenclature"));
					ElementNomenclature.Art = ВыборкаНоменклатура.NomenclatureScId;
					ElementNomenclature.QT = ВыборкаНоменклатура.QT;
					ElementNomenclature.Date = ВыборкаНоменклатура.SaleDate;
					ElementNomenclature.Summa = ВыборкаНоменклатура.Summa;
					ElementAgreement.Nomenclatures.Добавить(ElementNomenclature);
				КонецЦикла;
				ElementDate.Agreements.Добавить(ElementAgreement);
			КонецЦикла;
			TableAdjustments.Dates.Добавить(ElementDate);
		КонецЦикла;
		
		Значение = WSПрокси.LoadRefundAdjustments(TableAdjustments);
		
		Если Значение.Success Тогда
			Сообщить("Корректирока возвратов успешно");
		Иначе
			Сообщить("" + Значение.Comments);
		КонецЕсли;
		
	КонецЕсли;
		
	
	///////////////////////
	
	
	Если Ложь Тогда
		
		КоличествоЗаписейВТранзакции = 100;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	К.ServerTxId КАК ServerTxId,
		|	К.Price КАК Price,
		|	ИСТИНА КАК Обработано
		|ИЗ
		|	РегистрСведений.ТранзакцииESD КАК Т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КорректировкиESD КАК К
		|		ПО (Т.ServerTxId = К.ServerTxId)
		|ГДЕ
		|	Т.TransactionKind = ""Sale""
		|	И Т.Date >= &ДатаНачала
		|	И Т.Date <= &ДатаОкончания
		|	И НЕ К.Обработано
		|";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		НаборЗаписей = РегистрыСведений.КорректировкиESD.СоздатьНаборЗаписей();
		
		НачатьТранзакцию();
		НомерЗаписи = 0;
		Пока Выборка.Следующий() Цикл
			
			НомерЗаписи = НомерЗаписи + 1;
			Если НомерЗаписи >= КоличествоЗаписейВТранзакции Тогда
				ЗафиксироватьТранзакцию();
				НомерЗаписи = 0;
				НачатьТранзакцию();
			КонецЕсли;
			
			НаборЗаписей.Отбор.ServerTxId.Установить(Выборка.ServerTxId);
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Иначе	
		
	КонецЕсли;
	
КонецПроцедуры
